# Apply

In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({
                   'degisken1':[10,23,33,22,11,99],
                   'degisken2':[100,253,333,262,111,969]},
                 columns=['degisken1', 'degisken2'])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [5]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [8]:
df.apply('size')

degisken1    6
degisken2    6
dtype: int64

In [9]:
df.apply('max')

degisken1     99
degisken2    969
dtype: int64

In [10]:
df.apply(['max', min])

     degisken1  degisken2
max         99        969
min         10        100

In [11]:
df.apply('sum')

degisken1     198
degisken2    2028
dtype: int64

In [13]:
df.apply('mean')

degisken1     33.0
degisken2    338.0
dtype: float64

In [15]:
df.apply(['mean', 'sum'])

      degisken1  degisken2
mean       33.0      338.0
sum       198.0     2028.0

In [16]:
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'], 
                   'degisken1':[10,23,33,22,11,99],
                   'degisken2':[100,253,333,262,111,969]},
                 columns=['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [17]:
df.groupby('gruplar').apply(sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [19]:
df.groupby('gruplar').apply('mean')

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [20]:
df.groupby('gruplar').apply('std')

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [ ]:
?df.apply